In [1]:
import pandas as pd
import json

#### From Json to Dataframe

In [2]:
with open("movies.json", encoding="utf-8") as file:
    movie_json = json.load(file)

In [3]:
movies_df = pd.DataFrame(movie_json)

In [4]:
movies_df.head(3)

  cast genres                                 title  year
0   []     []            After Dark in Central Park  1900
1   []     []  Boarding School Girls' Pajama Parade  1900
2   []     []        Buffalo Bill's Wild West Parad  1900

In [5]:
movies_df.tail(2)

,cast,genres,title,year
28793,"[Felicity Jones, Armie Hammer, Justin Theroux,...","[Biography, Drama]",On the Basis of Sex,2018
28794,"[Nicole Kidman, Tatiana Maslany, Sebastian Sta...","[Crime, Thriller]",Destroyer,2018

In [6]:
movies_df.columns

Index(['cast', 'genres', 'title', 'year'], dtype='object')

#### Accessing Column of Data Frame

In [7]:
list_of_cast = movies_df.cast
list_of_genre = movies_df["genres"]
list_of_title = movies_df["title"]
list_of_year = movies_df.year
year_title_df = movies_df[["year","title"]]

In [8]:
print(type(movies_df.cast))
print(type(list_of_cast))
print("===========")
print(type(movies_df.genres))
print(type(list_of_genre))
print("===========")
print(type(movies_df.title))
print(type(list_of_title))
print("===========")
print(type(movies_df.year))
print(type(list_of_year))
print("===========")
print(type(movies_df[["year", "title"]]))
print(type(year_title_df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
===========
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
===========
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
===========
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
===========
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

#### Accessing Row of DataFrame

In [9]:
movies_df.loc[100]

cast                           []
genres            [Comedy, Short]
title     The Interrupted Bathers
year                         1902
Name: 100, dtype: object

In [10]:
row_1 = movies_df.loc[0]

In [11]:
for i in row_1:
    print(i)

[]
[]
After Dark in Central Park
1900

In [12]:
print(type(row_1))
print("-------")
print(row_1)

<class 'pandas.core.series.Series'>
-------
cast                              []
genres                            []
title     After Dark in Central Park
year                            1900
Name: 0, dtype: object

In [13]:
print(row_1.title)

After Dark in Central Park

#### Accessing cell in DataFrame

In [14]:
print(row_1.cast)
print(row_1["cast"])
print(row_1[0])
print(movies_df.loc[0].cast)
print(movies_df.loc[0]["cast"])
print(movies_df.loc[0][0])
print("-------------")
print(row_1.title)
print(row_1["title"])
print(row_1[2])
print(movies_df.loc[0].title)
print(movies_df.loc[0]["title"])
print(movies_df.loc[0][2])
print(movies_df.loc[0,"title"])
print(movies_df.loc[0,["title","year"]])

[]
[]
[]
[]
[]
[]
-------------
After Dark in Central Park
After Dark in Central Park
After Dark in Central Park
After Dark in Central Park
After Dark in Central Park
After Dark in Central Park
After Dark in Central Park
title    After Dark in Central Park
year                           1900
Name: 0, dtype: object

In [15]:
movies_df.loc[123,["title","year"]]

title    The Effects of a Trolley Car Collision
year                                       1903
Name: 123, dtype: object

In [16]:
movies_df.title[100]

'The Interrupted Bathers'

In [17]:
print(movies_df.title)

0                               After Dark in Central Park
1                     Boarding School Girls' Pajama Parade
2                           Buffalo Bill's Wild West Parad
3                                                   Caught
4                                     Clowns Spinning Hats
5                       Capture of Boer Battery by British
6                                    The Enchanted Drawing
7                                        Feeding Sea Lions
8              How to Make a Fat Wife Out of Two Lean Ones
9                                          New Life Rescue
10                                        New Morning Bath
11       Searching Ruins on Broadway, Galveston, for De...
12             The Tribulations of an Amateur Photographer
13                                Trouble in Hogan's Alley
14                                          Two Old Sparks
15                              The Wonder, Ching Ling Foo
16                                      Watermelon Contest
17                                       Acrobats in Cairo
18                                      An Affair of Honor
19                          Another Job for the Undertaker
20                                Arrival of Tongkin Train
21                                    The Artist's Dilemma
22            Band and Battalion of the U.S. Indian School
23                              Barnum and Bailey's Circus
24                                       Beef Extract Room
25                                       Boxing in Barrels
26                                           Branding Hams
27                                   Buffalo Street Parade
28                               A Busy Corner at Armour's
29                                      The Bund, Shanghai
                               ...
28765                         The Girl in the Spider's Web
28766                                             Overlord
28767                     Conundrum: Secrets Among Friends
28768          Fantastic Beasts: The Crimes of Grindelwald
28769                                               Widows
28770                                       Instant Family
28771                            Ralph Breaks the Internet
28772                                             Creed II
28773                                           Robin Hood
28774                                           Green Book
28775                                        The Favourite
28776                              Anna and the Apocalypse
28777                           If Beale Street Could Talk
28778                                  Mary Queen of Scots
28779                                Under the Silver Lake
28780                                          The Silence
28781                            This One's for the Ladies
28782                                          Ben Is Back
28783                                       Mortal Engines
28784                    Spider-Man: Into the Spider-Verse
28785                                             The Mule
28786                                                 Vice
28787                                           Second Act
28788                                 Mary Poppins Returns
28789                                              Aquaman
28790                                            Bumblebee
28791                                    Welcome to Marwen
28792                                    Holmes and Watson
28793                                  On the Basis of Sex
28794                                            Destroyer
Name: title, Length: 28795, dtype: object

#### Write & Read in CSV

In [18]:
movies_df.to_csv("movies.csv", index=False)

In [19]:
data_movies = pd.read_csv("movies.csv")

In [20]:
data_movies.head(5)

  cast genres                                 title  year
0   []     []            After Dark in Central Park  1900
1   []     []  Boarding School Girls' Pajama Parade  1900
2   []     []        Buffalo Bill's Wild West Parad  1900
3   []     []                                Caught  1900
4   []     []                  Clowns Spinning Hats  1900

In [21]:
data_movies.groupby("year").count().head(5)

      cast  genres  title
year
1900    17      17     17
1901    80      80     80
1902     7       7      7
1903    78      78     78
1904    25      25     25

In [22]:
data_movies.where(data_movies["year"]==1900).head(5)

  cast genres                                 title    year
0   []     []            After Dark in Central Park  1900.0
1   []     []  Boarding School Girls' Pajama Parade  1900.0
2   []     []        Buffalo Bill's Wild West Parad  1900.0
3   []     []                                Caught  1900.0
4   []     []                  Clowns Spinning Hats  1900.0

In [23]:
data_movies[data_movies.astype(str)['genres']!='[]'].head(5)

,cast,genres,title,year
5,[],"['Short', 'Documentary']",Capture of Boer Battery by British,1900
8,[],['Comedy'],How to Make a Fat Wife Out of Two Lean Ones,1900
13,[],['Comedy'],Trouble in Hogan's Alley,1900
14,[],['Short'],Two Old Sparks,1900
15,['Ching Ling Foo'],['Short'],"The Wonder, Ching Ling Foo",1900

In [24]:
data_movies.columns

Index(['cast', 'genres', 'title', 'year'], dtype='object')

In [25]:
data_movies["no"] = "no"

In [26]:
data_movies.columns

Index(['cast', 'genres', 'title', 'year', 'no'], dtype='object')

In [27]:
list_cast = data_movies.cast
data_movies.cast.tail(5)

28790    ['Hailee Steinfeld', 'John Cena', 'Jorge Lende...
28791    ['Steve Carell', 'Leslie Mann', 'Diane Kruger'...
28792    ['Will Ferrell', 'John C. Reilly', 'Rebecca Ha...
28793    ['Felicity Jones', 'Armie Hammer', 'Justin The...
28794    ['Nicole Kidman', 'Tatiana Maslany', 'Sebastia...
Name: cast, dtype: object

In [32]:
list_genres = data_movies["genres"]
list_genres.tail(4)

28791               ['Fantasy', 'Drama']
28792    ['Action', 'Mystery', 'Comedy']
28793             ['Biography', 'Drama']
28794              ['Crime', 'Thriller']
Name: genres, dtype: object

In [29]:
row_28791 = data_movies.loc[28791]
row_28791

cast      ['Steve Carell', 'Leslie Mann', 'Diane Kruger'...
genres                                 ['Fantasy', 'Drama']
title                                     Welcome to Marwen
year                                                   2018
no                                                       no
Name: 28791, dtype: object

In [30]:
print(type(row_28791))

<class 'pandas.core.series.Series'>

In [33]:
print(row_28791.cast)
print(row_28791["cast"])
print(row_28791[0])
print(data_movies.loc[28791].cast)
print(data_movies.loc[28791]["cast"])
print(data_movies.loc[28791][0])

['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']
['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']
['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']
['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']
['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']
['Steve Carell', 'Leslie Mann', 'Diane Kruger', 'Falk Hentschel', 'Janelle Monáe', 'Eiza Gonzalez', 'Gwendoline Christie']

#### Create Dataframe from scratch

In [25]:
empty_df = pd.DataFrame(columns = ["empty","data","frame"])
len(empty_df)

0

In [26]:
empty_df

Empty DataFrame
Columns: [empty, data, frame]
Index: []

In [27]:
df_from_scratch = pd.DataFrame(
    [["lala",3,["main","makan"]],
     ["lili",2],
     ["lulu",5],
     ["lele",1]
    ], 
    columns=["nama", "kelas","hobi"]
)

In [28]:
df_from_scratch

   nama  kelas           hobi
0  lala      3  [main, makan]
1  lili      2           None
2  lulu      5           None
3  lele      1           None

In [29]:
type(df_from_scratch.hobi[0])

list

In [30]:
student_column = ["nama", "kelas"]

In [31]:
student_data = [
    ["nana", 3],
    ["nini", 2],
    ("nunu", 4)
]
student_df = pd.DataFrame(student_data, columns=student_column)

In [32]:
student_df

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4

In [33]:
nama = ["kaka", "kiki", "keke"]
kelas = [2,5,3]
student_df2 = pd.DataFrame(zip(nama,kelas), columns = student_column)

In [34]:
list1 = ["a","b","c"]
list2 = [1,2,3]
zipped = zip(list1, list2)

In [35]:
for z in zipped:
    print(z)

('a', 1)
('b', 2)
('c', 3)

In [ ]:
student_df2

#### Adding Rows to A Dataframe

In [ ]:
print(len(student_df))
student_df = student_df.append(student_df2, ignore_index=True)
print(len(student_df))
student_df

In [ ]:
student_df = student_df.append(
    {"nama": "Tuti", "kelas":3},
    ignore_index=True
)

In [118]:
new_students = [["dido",2],["dodi",3],["didi",1]]

print(len(student_df))
for student in new_students:
    student_df = student_df.append(
        {"nama": student[0], "kelas":student[1]},
        ignore_index=True
    )
print(len(student_df))

10
13

In [119]:
student_df

    nama  kelas
0   nana      3
1   nini      2
2   nunu      4
3   kaka      2
4   kiki      5
5   keke      3
6   dido      2
7   dodi      3
8   didi      1
9   Tuti      3
10  dido      2
11  dodi      3
12  didi      1

In [133]:
transferred_students = [["caca",4],["ica",3],["oca",6]]
print(len(student_df))
pd.concat(
    [pd.DataFrame(student, columns = ["nama"]) 
     for student in transferred_students],
    ignore_index=True
)
print(len(student_df))
student_df

13
13

    nama  kelas
0   nana      3
1   nini      2
2   nunu      4
3   kaka      2
4   kiki      5
5   keke      3
6   dido      2
7   dodi      3
8   didi      1
9   Tuti      3
10  dido      2
11  dodi      3
12  didi      1

#### Adding columns to a Dataframe

In [134]:
student_df

    nama  kelas
0   nana      3
1   nini      2
2   nunu      4
3   kaka      2
4   kiki      5
5   keke      3
6   dido      2
7   dodi      3
8   didi      1
9   Tuti      3
10  dido      2
11  dodi      3
12  didi      1

In [135]:
print(student_df.columns)
student_df["nama_sekolah"] = "SDN Gembira Ria"
print(student_df.columns)

Index(['nama', 'kelas'], dtype='object')
Index(['nama', 'kelas', 'nama_sekolah'], dtype='object')

In [136]:
student_df.head(2)

   nama  kelas     nama_sekolah
0  nana      3  SDN Gembira Ria
1  nini      2  SDN Gembira Ria

In [145]:
student_df["usia"] = 0
student_df.head(3)

   nama  kelas     nama_sekolah  usia
0  nana      3  SDN Gembira Ria     0
1  nini      2  SDN Gembira Ria     0
2  nunu      4  SDN Gembira Ria     0

In [153]:
student_df.loc[1,"usia"]

8

In [147]:
for i in range(0, len(student_df)):
    student_df.loc[i,"usia"] = 6 + student_df.loc[i]["kelas"]

In [149]:
for i in range(0, len(student_df)):
    student_df.loc[i,"usia3"] = 6 + student_df.loc[i]["kelas"]

In [155]:
student_df["usia_2"] = student_df["kelas"].apply(
    lambda value_kelas: value_kelas+6
)

In [156]:
student_df

    nama  kelas     nama_sekolah  usia  usia_2  usia3
0   nana      3  SDN Gembira Ria     9       9    9.0
1   nini      2  SDN Gembira Ria     8       8    8.0
2   nunu      4  SDN Gembira Ria    10      10   10.0
3   kaka      2  SDN Gembira Ria     8       8    8.0
4   kiki      5  SDN Gembira Ria    11      11   11.0
5   keke      3  SDN Gembira Ria     9       9    9.0
6   dido      2  SDN Gembira Ria     8       8    8.0
7   dodi      3  SDN Gembira Ria     9       9    9.0
8   didi      1  SDN Gembira Ria     7       7    7.0
9   Tuti      3  SDN Gembira Ria     9       9    9.0
10  dido      2  SDN Gembira Ria     8       8    8.0
11  dodi      3  SDN Gembira Ria     9       9    9.0
12  didi      1  SDN Gembira Ria     7       7    7.0

#### Summary of Dataframe

In [ ]:
student_df.usia.min()

In [161]:
print(max(student_df.nama))
print(student_df.nama.min())

nunu
Tuti

In [157]:
print(max(student_df.usia))
print(student_df.usia.idxmax())
print(student_df.usia.min())
print(student_df.usia.idxmin())
print(student_df.usia.mean())
print(student_df.usia.median())
print(student_df.usia.sum())

11
4
7
8
8.615384615384615
9.0
112

#### Sorting

In [163]:
student_df.sort_values(by="usia", ascending=True)

    nama  kelas     nama_sekolah  usia  usia_2  usia3
8   didi      1  SDN Gembira Ria     7       7    7.0
12  didi      1  SDN Gembira Ria     7       7    7.0
1   nini      2  SDN Gembira Ria     8       8    8.0
3   kaka      2  SDN Gembira Ria     8       8    8.0
6   dido      2  SDN Gembira Ria     8       8    8.0
10  dido      2  SDN Gembira Ria     8       8    8.0
0   nana      3  SDN Gembira Ria     9       9    9.0
5   keke      3  SDN Gembira Ria     9       9    9.0
7   dodi      3  SDN Gembira Ria     9       9    9.0
9   Tuti      3  SDN Gembira Ria     9       9    9.0
11  dodi      3  SDN Gembira Ria     9       9    9.0
2   nunu      4  SDN Gembira Ria    10      10   10.0
4   kiki      5  SDN Gembira Ria    11      11   11.0

In [173]:
student_df.sort_values(by=["usia","nama"], ascending=[True,False])

    nama  kelas     nama_sekolah  usia  usia_2  usia3
8   didi      1  SDN Gembira Ria     7       7    7.0
12  didi      1  SDN Gembira Ria     7       7    7.0
1   nini      2  SDN Gembira Ria     8       8    8.0
3   kaka      2  SDN Gembira Ria     8       8    8.0
6   dido      2  SDN Gembira Ria     8       8    8.0
10  dido      2  SDN Gembira Ria     8       8    8.0
0   nana      3  SDN Gembira Ria     9       9    9.0
5   keke      3  SDN Gembira Ria     9       9    9.0
7   dodi      3  SDN Gembira Ria     9       9    9.0
11  dodi      3  SDN Gembira Ria     9       9    9.0
9   Tuti      3  SDN Gembira Ria     9       9    9.0
2   nunu      4  SDN Gembira Ria    10      10   10.0
4   kiki      5  SDN Gembira Ria    11      11   11.0

#### Slicing & Where Selection

In [174]:
student_df["usia"]

0      9
1      8
2     10
3      8
4     11
5      9
6      8
7      9
8      7
9      9
10     8
11     9
12     7
Name: usia, dtype: int64

In [176]:
student_df[student_df["usia"] == 8]

    nama  kelas     nama_sekolah  usia  usia_2  usia3
1   nini      2  SDN Gembira Ria     8       8    8.0
3   kaka      2  SDN Gembira Ria     8       8    8.0
6   dido      2  SDN Gembira Ria     8       8    8.0
10  dido      2  SDN Gembira Ria     8       8    8.0

In [178]:
aaa = student_df.where(student_df["usia"] == 9)

In [177]:
student_df.where(student_df["usia"] == 9)

    nama  kelas     nama_sekolah  usia  usia_2  usia3
0   nana    3.0  SDN Gembira Ria   9.0     9.0    9.0
1    NaN    NaN              NaN   NaN     NaN    NaN
2    NaN    NaN              NaN   NaN     NaN    NaN
3    NaN    NaN              NaN   NaN     NaN    NaN
4    NaN    NaN              NaN   NaN     NaN    NaN
5   keke    3.0  SDN Gembira Ria   9.0     9.0    9.0
6    NaN    NaN              NaN   NaN     NaN    NaN
7   dodi    3.0  SDN Gembira Ria   9.0     9.0    9.0
8    NaN    NaN              NaN   NaN     NaN    NaN
9   Tuti    3.0  SDN Gembira Ria   9.0     9.0    9.0
10   NaN    NaN              NaN   NaN     NaN    NaN
11  dodi    3.0  SDN Gembira Ria   9.0     9.0    9.0
12   NaN    NaN              NaN   NaN     NaN    NaN

#### Grouping

In [180]:
student_df.groupby("kelas").mean()

       usia  usia_2  usia3
kelas
1         7       7    7.0
2         8       8    8.0
3         9       9    9.0
4        10      10   10.0
5        11      11   11.0

In [182]:
student_df.columns

Index(['nama', 'kelas', 'nama_sekolah', 'usia', 'usia_2', 'usia3'], dtype='object')

In [181]:
student_df.groupby(["kelas", "usia"]).mean()

            usia_2  usia3
kelas usia
1     7          7    7.0
2     8          8    8.0
3     9          9    9.0
4     10        10   10.0
5     11        11   11.0

In [183]:
student_df.groupby(["kelas"]).sum()

       usia  usia_2  usia3
kelas
1        14      14   14.0
2        32      32   32.0
3        45      45   45.0
4        10      10   10.0
5        11      11   11.0

In [184]:
student_df[["kelas", "usia"]].groupby(["kelas"]).sum()

       usia
kelas
1        14
2        32
3        45
4        10
5        11

In [185]:
student_df.groupby(["kelas"]).count()

       nama  nama_sekolah  usia  usia_2  usia3
kelas
1         2             2     2       2      2
2         4             4     4       4      4
3         5             5     5       5      5
4         1             1     1       1      1
5         1             1     1       1      1

In [186]:
student_df[["kelas", "usia"]].groupby(["kelas"]).count()

       usia
kelas
1         2
2         4
3         5
4         1
5         1

In [187]:
student_df.groupby(["kelas"]).nama.unique()

kelas
1                      [didi]
2          [nini, kaka, dido]
3    [nana, keke, dodi, Tuti]
4                      [nunu]
5                      [kiki]
Name: nama, dtype: object

In [188]:
student_df.groupby(["kelas"]).nama.nunique()

kelas
1    1
2    3
3    4
4    1
5    1
Name: nama, dtype: int64

In [189]:
student_df.append(
    pd.DataFrame([["lulu",3],["lolo",2]],columns=["nama","kelas"]),
    ignore_index = True
)

/usr/local/lib/python3.7/site-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

    kelas  nama     nama_sekolah  usia  usia3  usia_2
0       3  nana  SDN Gembira Ria   9.0    9.0     9.0
1       2  nini  SDN Gembira Ria   8.0    8.0     8.0
2       4  nunu  SDN Gembira Ria  10.0   10.0    10.0
3       2  kaka  SDN Gembira Ria   8.0    8.0     8.0
4       5  kiki  SDN Gembira Ria  11.0   11.0    11.0
5       3  keke  SDN Gembira Ria   9.0    9.0     9.0
6       2  dido  SDN Gembira Ria   8.0    8.0     8.0
7       3  dodi  SDN Gembira Ria   9.0    9.0     9.0
8       1  didi  SDN Gembira Ria   7.0    7.0     7.0
9       3  Tuti  SDN Gembira Ria   9.0    9.0     9.0
10      2  dido  SDN Gembira Ria   8.0    8.0     8.0
11      3  dodi  SDN Gembira Ria   9.0    9.0     9.0
12      1  didi  SDN Gembira Ria   7.0    7.0     7.0
13      3  lulu              NaN   NaN    NaN     NaN
14      2  lolo              NaN   NaN    NaN     NaN

#### null values

In [195]:
null_student = pd.DataFrame(
    [["lala"]], 
    columns=["nama"]
)

In [220]:
student_df = student_df.append(null_student, ignore_index=True)

In [221]:
len(student_df)

17

In [222]:
no_nan_value = student_df.dropna()

In [223]:
filled_student_df = student_df.fillna(7)

In [225]:
len(no_nan_value)

13